#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Wed Mar 10 11:16:17 2021

@author: yuan
"""

# =============================================================================
# 1. 进制转换，参数为整数形式，返回值为字符串str
# =============================================================================
print(bin(0o333333))  #转换成二进制
print(bin(222))
print(oct(555))  #转换成八进制

a1 = hex(333)  #转换成十六进制
print(a1)
print(type(a1))
# =============================================================================
# 2. int(1，2) 参数1为数字字符串，2为指明参数1为什么类型，返回值十进制整数，不四舍五入
# =============================================================================
print(int('39'))
print(int('101', 2))
#print(int(101, 2))

# =============================================================================
# 3. ord() 参数为单个ASCII码的值，返回值为ASCII码序号,整数值
# chr() 参数为int类型，返回值为ASCII对应序号的字符类型为str
# str() 参数为任意类型的参数，返回值为字符串
# =============================================================================
print(ord('a'))
print(chr(99))
print(str(123213))

# =============================================================================
# 4. max(), min(), sum() max(iterable, *[, key, default]) ,key= 以...比较标准
#如果只提供了一个位置参数，它必须是非空 iterable，返回可迭代对象中最大的元素；
#如果提供了两个及以上的位置参数，则返回最大的位置参数。
#有两个可选只能用关键字的实参。key 实参指定排序函数用的参数
#如果有多个最大元素，则此函数将返回第一个找到的。
#sum(x, start = 0)
# =============================================================================
a = max('2','3','4','5','1','13','2','22222','3333', key = len)

# =============================================================================
# 5. type() isinstance() 查看和判断数据类型
# =============================================================================

# =============================================================================
# 6. range() 
# class range(stop)
# class range(start, stop[, step])
# 虽然被称为函数，但 range 实际上是一个不可变的序列类型，
# 该range类型表示的一个不可变的数字序列。
# 省略step，默认step为1
# 省略start，默认start为0
# 如果step>0，序列的值为r[i] = start + step*i
# 如果step<0，序列的值为r[i] = start - step*i
# =============================================================================

a = range(25,2,-2)
a = range(25)
b = list(a)
print(b)

# =============================================================================
# 7. map() : map(function, iterable, ...)
#  把将iterable序列中的每一个值，作为参数进入function，返回并输出结果，形成一个新的map对象（序列）。
# =============================================================================

a = range(20)
b = map(str, a)
print(list(b))
print(type(b))

# =============================================================================
# 8. round()四舍五入round(number[, ndigits])
# 返回 number 舍入到小数点后 ndigits 位精度的值。 
# sorted(iterable, *, key=None, reverse=False)
# 根据 iterable 中的项返回一个新的已排序列表。
# 具有两个可选参数，它们都必须指定为关键字参数。
# =============================================================================


# =============================================================================
# 9.input([prompt])如果存在 prompt 实参，则将其写入标准输出，末尾不带换行符。
#该函数从输入中读取一行，并转换成字符串，除了末尾的换行符
#特殊用法，赋值左边的变量数目与序列中元素相同，则进行序列pack
#split()，字符串的方法，str.split(sep=None, maxsplit=-1)
#使用 sep 作为分隔字符串
#使用 maxsplit作为分割次数，默认-1为不限次数
# =============================================================================

x,y = map(int, input('-->').split(',',2))
print(type(x))
print(x)
print(y)


# =============================================================================
# 10. print()
# print(*objects, sep=' ', end='\n', file=sys.stdout, flush=False)¶
# sep多个字符串输出 之间的分割
# end是所有字符串输出完之后的
# file必须是一个具有 write(string) 方法的对象。
# 如果参数不存在或为 None，则将使用 sys.stdout。
# flush为缓存刷新
# =============================================================================
a,b = 1,2
print(type(a))
print('a=',a,'  ','b=',b)
print('a=%d,b=%d'%(a,b))



# =============================================================================
# 11.实验2
# 一句话分割，取前三个单词
# a,b,c,d = input('A sentence :').split(' ',3)
# print(a,b,c)
# 五位整数
# m = list(map(int, input('五位整数：')))
# print('sum=',sum(m),'max=',max(m),'min=',min(m))
# =============================================================================
